0907.md

---------------------------------
------------0907-----------------
---------------------------------
今天主要是调试搭建平台，nvr。
尤其是设备登陆和远程cope备份资料需要耗费时间。

下一步可能需要跟服务器的加密通信。对称加密和非对称加密openssl
---------------------------------
------------0908-----------------
---------------------------------
表彰大会
soup接口
花一天时间注释完呗。
说明我的想法。
b站的openssl和github上的
泰哥说发论文没问题，难得是发顶会。

环境变量：
export LD_LIBRARY_PATH=../3rd/ffmpeg/:/opt/lib/hi3559/live555:/opt/lib/hi3559/openssl:/opt/lib/hi3559/x264::/opt/lib/hi3559/ffmpeg:../3rd/svp/:../3rd/curl/:$LD_LIBRARY_PATH
---------------------------------
------------0909-----------------
---------------------------------
主要是准备数模比赛，及查看目标院校。
---------------------------------
------------0910-----------------
---------------------------------
开支明细：
坐等11月份的2w阿。然后日常开销都不太够了这个月。
花呗度日。
喝酒1000+老妹买鞋600+话费200+
得省着点来了，房租5000，

1、搜索：Probe： 发现网络摄像头，获取webserver地址
2、能力获取：GetCapabilities：获取设备能力文件，从中识别出媒体信息地址URI：
3、媒体信息获取：GetProfiles： 获取媒体信息文件，识别主通道、子通道的视频编码分辨率
4、RTSP地址获取：GetStreamUri：获取指定通道的流媒体地址 

 rtsp://192.168.15.240:554/Streaming/Channels/2?transportmode=unicast


我跳过中间的流程，按照你之前的测试URL地址可以获取到YUV。
然后我对照着流程，
但是之前的那些obvif流程，就是前两步GetWsdlUrl和GetCapabilities可以成功，
后面的GetProfiles和GetStreamUri这些总是失败的。


最后尝试一下这几个方向：
直接GetCapabilities加GetProfiles加GetStreamUri。如果失败，则去查鉴权的问题。
1、因为有错误返回的信息。说的是没有授权。
{error:12 faultstring:The action requested requires authorization and the sender is not authorized faultcode:SOAP-ENV:Sender faultsubcode:"http://www.onvif.org/ver10/error":NotAuthorized faultdetail:(null)}

2、明天让果子去是一下请求http的返回。
stfp是可以成功的，只是获取stfp的地址失败：

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope" xmlns:SOAP-ENC="http://www.w3.org/2003/05/soap-encoding" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsdd="http://schemas.xmlsoap.org/ws/2005/04/discovery" xmlns:chan="http://schemas.microsoft.com/ws/2005/02/duplex" xmlns:wsa5="http://www.w3.org/2005/08/addressing" xmlns:netrm="http://schemas.microsoft.com/ws/2006/05/rm" xmlns:wsrm="http://docs.oasis-open.org/ws-rx/wsrm/200702" xmlns:c14n="http://www.w3.org/2001/10/xml-exc-c14n#" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" xmlns:wsc="http://schemas.xmlsoap.org/ws/2005/02/sc" xmlns:ds="http://www.w3.org/2000/09/xmldsig#" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:xmime="http://tempuri.org/xmime.xsd" xmlns:xop="http://www.w3.org/2004/08/xop/include" xmlns:tt="http://www.onvif.org/ver10/schema" xmlns:wsrfbf="http://docs.oasis-open.org/wsrf/bf-2" xmlns:wstop="http://docs.oasis-open.org/wsn/t-1" xmlns:wsrfr="http://docs.oasis-open.org/wsrf/r-2" xmlns:ns1="http://www.onvif.org/ver10/advancedsecurity/wsdl" xmlns:tdn="http://www.onvif.org/ver10/network/wsdl" xmlns:tds="http://www.onvif.org/ver10/device/wsdl" xmlns:tev="http://www.onvif.org/ver10/events/wsdl" xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2" xmlns:timg="http://www.onvif.org/ver20/imaging/wsdl" xmlns:tmd="http://www.onvif.org/ver10/deviceIO/wsdl" xmlns:tptz="http://www.onvif.org/ver20/ptz/wsdl" xmlns:trt="http://www.onvif.org/ver10/media/wsdl"><SOAP-ENV:Header><wsse:Security SOAP-ENV:mustUnderstand="true"><wsu:Timestamp wsu:Id="Time"><wsu:Created>2020-08-02T02:22:37Z</wsu:Created><wsu:Expires>2020-08-02T02:22:47Z</wsu:Expires></wsu:Timestamp></wsse:Security></SOAP-ENV:Header><SOAP-ENV:Body><trt:GetProfiles></trt:GetProfiles></SOAP-ENV:Body></SOAP-ENV:Envelope>


3、可能是通道设置的问题，获取通道也失败嘛毕竟。
---------------------------------
------------0911-----------------
---------------------------------

GetProfiles用的是摄像头web端配置里添加的用户密码。
其他函数鉴权用的是登陆摄像头web端的用户密码。这个解决了。但是onvif的账号密码没解决。


